In [ ]:
"""
Big Countries

There is a table World

+-----------------+------------+------------+--------------+---------------+
| name            | continent  | area       | population   | gdp           |
+-----------------+------------+------------+--------------+---------------+
| Afghanistan     | Asia       | 652230     | 25500100     | 20343000      |
| Albania         | Europe     | 28748      | 2831741      | 12960000      |
| Algeria         | Africa     | 2381741    | 37100000     | 188681000     |
| Andorra         | Europe     | 468        | 78115        | 3712000       |
| Angola          | Africa     | 1246700    | 20609294     | 100990000     |
+-----------------+------------+------------+--------------+---------------+
A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries' name, population and area.
"""

In [ ]:
"""testcase"""
{"headers": {"World": ["name", "continent",	"area",	"population", "gdp"]}, 
 "rows": {"World": [["Afghanistan", "Asia", 652230, 25500100, 20343000000], 
                    ["Albania", "Europe", 28748, 2831741, 12960000000], 
                    ["Algeria", "Africa", 2381741, 37100000, 188681000000], 
                    ["Andorra", "Europe", 468, 78115,	3712000000], 
                    ["Angola", "Africa", 1246700, 20609294, 100990000000]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS World;

CREATE TABLE World(
name varchar(50) NOT NULL,
cotinent varchar(50) NOT NULL,
area varchar(50) NOT NULL,
population int(32) NOT NULL,
gdp int(32) NOT NULL,
PRIMARY KEY ('name'));

INSERT INTO World VALUES
("Afghanistan", "Asia", 652230, 25500100, 20343000000),
("Albania", "Europe", 28748, 2831741, 12960000000),
("Algeria", "Africa", 2381741, 37100000, 188681000000),
("Andorra", "Europe", 468, 78115,	3712000000),
("Angola", "Africa", 1246700, 20609294, 100990000000);

In [ ]:
"""SQL solution"""
# 1
SELECT name, population, area
FROM World
WHERE population > 25000000 OR area > 3000000

# 2
SELECT name, population, area
FROM World
WHERE population > 25000000
UNION 
SELECT name, population, area
FROM World
WHERE area > 3000000

In [1]:
"""pandas dataframe creation"""
import pandas as pd

w = [("Afghanistan", "Asia", 652230, 25500100, 20343000000),
("Albania", "Europe", 28748, 2831741, 12960000000),
("Algeria", "Africa", 2381741, 37100000, 188681000000),
("Andorra", "Europe", 468, 78115,	3712000000),
("Angola", "Africa", 1246700, 20609294, 100990000000)]

World = pd.DataFrame(w, columns=['name', 'continent', 'area', 'population', 'gdp'])
World.head()

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [3]:
# 1 selecting based on 2 columns
World[(World['area'] > 3000000) | (World['population'] > 25000000)][['name', 'population', 'area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [6]:
# 2 selecting based on either column and then combine the results
World_area = World[World['area'] > 3000000][['name', 'population', 'area']]
World_pop = World[World['population'] > 25000000][['name', 'population', 'area']]
pd.concat([World_area, World_pop])

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741